DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool httpServerStarted = false;
bool rawOtaServerStarted = false;
bool setupMode = false;
bool physicalSetupAuthorized = false;
String setupAuthorizationToken;
bool waitStatusRendered = false;
bool otaUploadSucceeded = false;
bool otaUploadInProgress = false;
bool otaUploadNeedsReboot = false;
String otaUploadError;
bool assetUploadSucceeded = false;
bool assetUploadInProgress = false;
String assetUploadError;
String assetUploadPath;
size_t assetUploadBytesSeen = 0;
File assetUploadFile;
String activeThemeSpecPath;
String activeThemeSpecHash;
codexbar_display::esp8266::wifi_setup::State setupWifiState;
bool rebootPending = false;
unsigned long rebootAtMs = 0;
bool bootRecoveryCounterNeedsClear = false;
unsigned long bootRecoveryClearAtMs = 0;
unsigned long lastFrameAcceptedAtMs = 0;
bool pendingWifiRender = false;
codexbar_display::core::SerialConsumeEvent pendingWifiRenderEvent;
bool frameStaleStatusRendered = false;
bool captiveDnsStarted = false;
unsigned long wifiDisconnectedAtMs = 0;
unsigned long wifiReconnectAttemptAtMs = 0;
bool wifiReconnectStatusRendered = false;
unsigned long physicalPairingWindowExpiresAtMs = 0;
FirmwareUpdateState firmwareUpdate;
bool firmwareUpdateNoticeDirty = false;
OtaUploadDiagnostics otaDiagnostics;
RuntimeRenderDiagnostics renderDiagnostics;
DeviceSettings deviceSettings;
String deviceAuthToken;
String bootID;
String bootResetReasonJSON;
uint32_t bootResetCounter = 0;

void addCorsHeaders();

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
constexpr const char* kDefaultThemeSpecPath = "/themes/u/mini-cl-1-e4fe6b.json";
constexpr const char* kPreviousDefaultThemeSpecPath = "/themes/u/mini-cl-1-b3c3f7.json";
constexpr const char* kLegacyDefaultThemeSpecPath = "/themes/u/mini-cl-1-410a37.json";
constexpr const char* kDefaultThemeSpecId = "mini-classic";
constexpr int kDefaultThemeSpecRev = 1;
#endif

void recordRenderFull(const char* kind, unsigned long durationUs) {
  renderDiagnostics.fullCount++;
  renderDiagnostics.lastKind = kind;
  renderDiagnostics.lastFullKind = kind;
  renderDiagnostics.lastDurationUs = durationUs;
  renderDiagnostics.lastAtMs = millis();
}

void recordRenderPartial(const char* kind, unsigned long durationUs) {
  renderDiagnostics.partialCount++;
  renderDiagnostics.lastKind = kind;
  renderDiagnostics.lastPartialKind = kind;
  renderDiagnostics.lastDurationUs = durationUs;
  renderDiagnostics.lastAtMs = millis();
}

void recordAnimatedTickAttempt() {
  renderDiagnostics.animatedTickAttempts++;
}

String jsonEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length() + 8);
  for (size_t i = 0; i < raw.length(); ++i) {
    const char c = raw.charAt(i);
    switch (c) {
      case '\\':
        escaped += "\\\\";
        break;
      case '"':
        escaped += "\\\"";
        break;
      case '\n':
        escaped += "\\n";
        break;
      case '\r':
        escaped += "\\r";
        break;
      case '\t':
        escaped += "\\t";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

uint32_t fnv1a32(const String& raw) {
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < raw.length(); ++i) {
    hash ^= static_cast<uint8_t>(raw[i]);
    hash *= 16777619UL;
  }
  return hash;
}

String hashHex8(const String& raw) {
  String out = String(fnv1a32(raw), HEX);
  while (out.length() < 8) {
    out = "0" + out;
  }
  return out;
}

void appendJSONNullableString(String& out, const String& value) {
  if (value.length() == 0) {
    out += "null";
    return;
  }
  out += "\"";
  out += jsonEscape(value);
  out += "\"";
}

uint8_t clampBrightnessPercent(int value) {
  if (value < kMinBrightnessPercent) {
    return kMinBrightnessPercent;
  }
  if (value > kMaxBrightnessPercent) {
    return kMaxBrightnessPercent;
  }
  return static_cast<uint8_t>(value);
}

void applyDeviceSettings() {
  if (renderer.SupportsBrightnessControl()) {
    renderer.ApplyBrightnessPercent(deviceSettings.brightnessPercent);
  }
}

bool loadDeviceSettings() {
  deviceSettings = DeviceSettings{};
  if (!LittleFS.begin() || !LittleFS.exists(kDeviceSettingsPath)) {
    applyDeviceSettings();
    return false;
  }
  File file = LittleFS.open(kDeviceSettingsPath, "r");
  if (!file) {
    applyDeviceSettings();
    return false;
  }
  const int brightness = file.read();
  file.close();
  if (brightness <= 0) {
    applyDeviceSettings();
    return false;
  }
  deviceSettings.brightnessPercent = clampBrightnessPercent(brightness);
  applyDeviceSettings();
  return true;
}

bool saveDeviceSettings() {
  if (!LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kDeviceSettingsPath, "w");
  if (!file) {
    return false;
  }
  const size_t written = file.write(&deviceSettings.brightnessPercent, 1);
  file.close();
  return written > 0;
}

bool validAuthToken(const String& value) {
  if (value.length() < 16 || value.length() > 64) {
    return false;
  }
  for (size_t i = 0; i < value.length(); ++i) {
    const char c = value.charAt(i);
    const bool ok =
        (c >= 'a' && c <= 'z') ||
        (c >= 'A' && c <= 'Z') ||
        (c >= '0' && c <= '9') ||
        c == '-' ||
        c == '_';
    if (!ok) {
      return false;
    }
  }
  return true;
}

String generateAuthToken() {
  uint32_t seed = ESP.getCycleCount() ^ micros() ^ (static_cast<uint32_t>(ESP.getChipId()) << 8);
  randomSeed(seed);
  String token;
  token.reserve(32);
  for (uint8_t i = 0; i < 4; ++i) {
    uint32_t value = static_cast<uint32_t>(random(0x10000)) << 16;
    value |= static_cast<uint32_t>(random(0x10000));
    char chunk[9];
    snprintf(chunk, sizeof(chunk), "%08lx", static_cast<unsigned long>(value));
    token += chunk;
  }
  return token;
}

bool loadDeviceAuthToken() {
  deviceAuthToken = "";
  if (!LittleFS.begin() || !LittleFS.exists(kDeviceAuthTokenPath)) {
    return false;
  }
  File file = LittleFS.open(kDeviceAuthTokenPath, "r");
  if (!file) {
    return false;
  }
  String token = file.readString();
  file.close();
  token.trim();
  if (!validAuthToken(token)) {
    return false;
  }
  deviceAuthToken = token;
  return true;
}

bool saveDeviceAuthToken(const String& token) {
  if (!validAuthToken(token) || !LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kDeviceAuthTokenPath, "w");
  if (!file) {
    return false;
  }
  file.print(token);
  file.close();
  deviceAuthToken = token;
  return true;
}

bool deviceAuthConfigured() {
  return deviceAuthToken.length() > 0;
}

String requestAuthToken() {
  String token = webServer.header(kDeviceAuthHeader);
  token.trim();
  if (token.length() == 0) {
    token = webServer.arg("token");
    token.trim();
  }
  return token;
}

