DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool requestHasValidAuth() {
  if (!deviceAuthConfigured()) {
    return true;
  }
  return requestAuthToken() == deviceAuthToken;
}

bool requestHasCurrentDeviceToken() {
  return deviceAuthConfigured() && requestAuthToken() == deviceAuthToken;
}

bool requestHasValidSetupAuthorization() {
  String token = webServer.arg("setup_token");
  token.trim();
  return setupMode && physicalSetupAuthorized &&
      setupAuthorizationToken.length() > 0 && token == setupAuthorizationToken;
}

bool physicalPairingWindowOpen() {
  if (physicalPairingWindowExpiresAtMs == 0) {
    return false;
  }
  if (static_cast<long>(physicalPairingWindowExpiresAtMs - millis()) <= 0) {
    physicalPairingWindowExpiresAtMs = 0;
    return false;
  }
  return true;
}

unsigned long physicalPairingWindowSecondsRemaining() {
  if (!physicalPairingWindowOpen()) {
    return 0;
  }
  return (physicalPairingWindowExpiresAtMs - millis() + 999UL) / 1000UL;
}

bool authorizeWifiCredentialWrite() {
  if (codexbar_display::esp8266::WifiSecurityPolicy::AllowsCredentialWrite(
          physicalSetupAuthorized,
          requestHasValidSetupAuthorization(),
          deviceAuthConfigured(),
          requestHasCurrentDeviceToken())) {
    return true;
  }
  addCorsHeaders();
  if (deviceAuthConfigured()) {
    webServer.sendHeader("WWW-Authenticate", "VibeTV token");
    webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
  } else {
    webServer.send(403, "text/plain; charset=utf-8", "physical setup confirmation required");
  }
  return false;
}

bool requireWriteAuth() {
  if (requestHasValidAuth()) {
    return true;
  }
  addCorsHeaders();
  webServer.sendHeader("WWW-Authenticate", "VibeTV token");
  webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
  return false;
}

void appendAuthStatusJSON(String& out) {
  out += "\"auth\":{\"paired\":";
  out += deviceAuthConfigured() ? "true" : "false";
  out += ",\"tokenHeader\":\"";
  out += kDeviceAuthHeader;
  out += "\",\"pairingWindowOpen\":";
  out += physicalPairingWindowOpen() ? "true" : "false";
  out += ",\"pairingWindowSeconds\":";
  out += String(physicalPairingWindowSecondsRemaining());
  out += "}";
}

void appendBrightnessCapabilityJSON(String& out) {
  out += "{\"supported\":";
  out += renderer.SupportsBrightnessControl() ? "true" : "false";
  out += "}";
}

void appendSettingsJSON(String& out) {
  out += "\"settings\":{\"display\":{\"brightnessPercent\":";
  out += String(deviceSettings.brightnessPercent);
  out += "}}";
}

void markFirmwareUpdateNoticeDirty() {
  if (!codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    return;
  }
  if (!codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec) {
    return;
  }
  if (!runtimeCtx.screenDirty && !waitStatusRendered && !frameStaleStatusRendered) {
    firmwareUpdateNoticeDirty = true;
  } else {
    runtimeCtx.screenDirty = true;
  }
}

bool shouldShowFirmwareUpdateNotice() {
  return firmwareUpdate.available &&
         firmwareUpdate.noticeVisible &&
         !setupMode &&
         !waitStatusRendered &&
         !frameStaleStatusRendered &&
         codexbar_display::app::HasFrame(runtimeCtx) &&
         codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec &&
         !codexbar_display::app::CurrentFrame(runtimeCtx).hasError;
}

const char* currentFirmwareUpdateNoticeText() {
  if (firmwareUpdate.noticePhase >= kFirmwareUpdateNoticeTextCount) {
    firmwareUpdate.noticePhase = 0;
  }
  if (firmwareUpdate.noticePhase == kFirmwareUpdateNoticeAvailablePhase) {
    return "Update available";
  }
  if (firmwareUpdate.noticePhase == kFirmwareUpdateNoticeAppPhase) {
    return kCustomerAppHost;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (runtimeCtx.topLineOverride.length()) {
    return runtimeCtx.topLineOverride.c_str();
  }
  if (frame.label.length()) {
    return frame.label.c_str();
  }
  if (frame.provider.length()) {
    return frame.provider.c_str();
  }
  return "Provider";
}

void drawFirmwareUpdateNotice() {
  if (!shouldShowFirmwareUpdateNotice()) {
    firmwareUpdateNoticeDirty = false;
    return;
  }
  renderer.DrawFirmwareUpdateNotice(runtimeCtx, currentFirmwareUpdateNoticeText());
  firmwareUpdateNoticeDirty = false;
}

void clearFirmwareUpdateNotice() {
  if (!firmwareUpdate.noticeVisible) {
    return;
  }
  firmwareUpdate.noticeVisible = false;
  firmwareUpdate.noticePhase = 0;
  firmwareUpdate.noticeLastToggleAtMs = 0;
  firmwareUpdateNoticeDirty = false;
  if (codexbar_display::app::HasFrame(runtimeCtx) &&
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasError &&
      !waitStatusRendered &&
      !frameStaleStatusRendered) {
    runtimeCtx.screenDirty = true;
  }
}

void maintainFirmwareUpdateNotice() {
  if (!firmwareUpdate.available ||
      setupMode ||
      frameStaleStatusRendered ||
      !codexbar_display::app::HasFrame(runtimeCtx) ||
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    clearFirmwareUpdateNotice();
    return;
  }
  if (!firmwareUpdate.noticeVisible) {
    return;
  }
  const unsigned long nowMs = millis();
  if (firmwareUpdate.noticeLastToggleAtMs == 0) {
    firmwareUpdate.noticeLastToggleAtMs = nowMs;
    return;
  }
  if ((nowMs - firmwareUpdate.noticeLastToggleAtMs) >= kFirmwareUpdateNoticeToggleMs) {
    firmwareUpdate.noticeLastToggleAtMs = nowMs;
    firmwareUpdate.noticePhase = (firmwareUpdate.noticePhase + 1) % kFirmwareUpdateNoticeTextCount;
    markFirmwareUpdateNoticeDirty();
  }
}

void applyFrameUpdateState() {
  if (!codexbar_display::app::HasFrame(runtimeCtx)) {
    return;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (!frame.hasUpdateAvailable) {
    clearFirmwareUpdateNotice();
    return;
  }

  String nextStatus = frame.updateStatus;
  if (nextStatus.length() == 0) {
    nextStatus = frame.updateAvailable ? "update_available" : "current";
  }
  const bool changed = firmwareUpdate.available != frame.updateAvailable ||
                       firmwareUpdate.latestVersion != frame.updateLatestVersion ||
                       firmwareUpdate.lastStatus != nextStatus ||
                       firmwareUpdate.lastError != frame.updateLastError;
  firmwareUpdate.available = frame.updateAvailable;
  firmwareUpdate.latestVersion = frame.updateLatestVersion;
  firmwareUpdate.lastError = frame.updateLastError;
  firmwareUpdate.lastCheckedAtMs = millis();
  firmwareUpdate.nextCheckAtMs = 0;
  firmwareUpdate.lastStatus = nextStatus;

  if (!firmwareUpdate.available) {
    clearFirmwareUpdateNotice();
    return;
  }
  if (!firmwareUpdate.noticeVisible || changed) {
    firmwareUpdate.noticeVisible = true;
    firmwareUpdate.noticePhase = 0;
    firmwareUpdate.noticeLastToggleAtMs = millis();
    markFirmwareUpdateNoticeDirty();
  }
}

void drawWaitingForCompanionStatus() {
  const unsigned long renderStartUs = micros();
  renderer.DrawConnectedSetupInstructions(runtimeCtx, kCustomerAppHost, WiFi.localIP().toString());
  recordRenderFull("connected_setup", micros() - renderStartUs);
  waitStatusRendered = true;
}

void drawWifiConnectingStatus(const String& ssid) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV", "Connecting WiFi", ssid);
  recordRenderFull("status", micros() - renderStartUs);
}

