DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  if (!codexbar_display::app::HasFrame(runtimeCtx) && !runtimeCtx.screenDirty && !waitStatusRendered) {
    renderer.TickSplash(runtimeCtx);
  }

  if (runtimeCtx.screenDirty && !waitStatusRendered && !renderer.ShouldDeferDirtyRender(runtimeCtx)) {
    const unsigned long renderStartUs = micros();
    const char* fullKind = "usage";
    bool keepDirty = false;
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
    renderer.DrawUsage(runtimeCtx);
#else
    if (!codexbar_display::app::HasFrame(runtimeCtx)) {
      fullKind = "splash";
      renderer.DrawSplash(runtimeCtx);
    } else if (codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
      fullKind = "error";
      renderer.DrawStatus(
          runtimeCtx,
          "VIBE TV",
          displayErrorMessage(codexbar_display::app::CurrentFrame(runtimeCtx).error),
          kCustomerAppHost);
    } else {
      fullKind = codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec ? "theme_spec_usage" : "usage";
      renderer.DrawUsage(runtimeCtx);
      if (codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec &&
          !renderer.DebugSnapshot().themeSpecRenderOk) {
        keepDirty = true;
      }
    }
#endif
    rendered = true;
    renderDurationUs = micros() - renderStartUs;
    drawFirmwareUpdateNotice();
    renderDurationUs = micros() - renderStartUs;
    recordRenderFull(fullKind, renderDurationUs);
    if (!keepDirty) {
      runtimeCtx.screenDirty = false;
      firmwareUpdateNoticeDirty = false;
    }
  }

#ifdef CODEXBAR_DISPLAY_RUNTIME_BENCH
  recordBench(loopStartUs, rendered, renderDurationUs);
#else
  (void)loopStartUs;
  (void)rendered;
  (void)renderDurationUs;
#endif

  if (httpServerStarted) {
    webServer.handleClient();
  }
  handleRawOtaClient();
  if (captiveDnsStarted) {
    dnsServer.processNextRequest();
  }
  if (rebootPending && static_cast<long>(millis() - rebootAtMs) >= 0) {
    Serial.println("reboot_now");
    delay(100);
    ESP.restart();
  }

  if (bootRecoveryCounterNeedsClear && static_cast<long>(millis() - bootRecoveryClearAtMs) >= 0) {
    clearBootRecoveryCounter();
  }

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  delay(renderer.AnimationWorkPending() ? 1 : 20);
#else
  delay(20);
#endif
}
